Terraform plan for __staging__
<details>
<summary>Plan: 50 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.order-notification-grn.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "***********"
      + skip_delete         = (known after apply)
    }

  # module.order-notification-grn.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-grn.google_pubsub_subscription.push_subscriptions["order-notification-grn-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-grn-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-grn"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-grn-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-grn.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-grn-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-grn-push"
    }

  # module.order-notification-grn.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-grn"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-grn.google_pubsub_topic_iam_member.push_topic_binding["order-notification-grn-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-grn-dl"
    }

  # module.order-notification-grn-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-grn-dl.google_pubsub_subscription.pull_subscriptions["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-grn-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-grn-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-grn-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-grn-dl-error"
    }

  # module.order-notification-grn-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-grn-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-grn-dl.google_pubsub_topic_iam_member.pull_topic_binding["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-grn-dl"
    }

  # module.order-notification-ian.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "***********"
      + skip_delete         = (known after apply)
    }

  # module.order-notification-ian.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-ian.google_pubsub_subscription.push_subscriptions["order-notification-ian-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ian-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ian"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-ian-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-ian.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ian-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ian-push"
    }

  # module.order-notification-ian.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-ian"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-ian.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ian-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-ian-dl"
    }

  # module.order-notification-ian-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-ian-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ian-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ian-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ian-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ian-dl-error"
    }

  # module.order-notification-ian-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-ian-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-ian-dl.google_pubsub_topic_iam_member.pull_topic_binding["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-ian-dl"
    }

  # module.order-notification-pick.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "***********"
      + skip_delete         = (known after apply)
    }

  # module.order-notification-pick.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-pick.google_pubsub_subscription.push_subscriptions["order-notification-pick-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-pick-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-pick"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-pick-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-pick.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-pick-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-pick-push"
    }

  # module.order-notification-pick.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-pick"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-pick.google_pubsub_topic_iam_member.push_topic_binding["order-notification-pick-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-pick-dl"
    }

  # module.order-notification-pick-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-pick-dl.google_pubsub_subscription.pull_subscriptions["order-notification-pick-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-pick-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-pick-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-pick-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-pick-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-pick-dl-error"
    }

  # module.order-notification-pick-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-pick-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-pick-dl.google_pubsub_topic_iam_member.pull_topic_binding["order-notification-pick-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-pick-dl"
    }

  # module.order-notification-ship.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "***********"
      + skip_delete         = (known after apply)
    }

  # module.order-notification-ship.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-ship.google_pubsub_subscription.push_subscriptions["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ship"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-ship-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-ship.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-push"
    }

  # module.order-notification-ship.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-ship"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-ship.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ship-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-ship-dl"
    }

  # module.order-notification-ship-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-ship-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ship-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ship-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-dl-error"
    }

  # module.order-notification-ship-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-ship-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-ship-dl.google_pubsub_topic_iam_member.pull_topic_binding["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-ship-dl"
    }

  # module.order-notification-tms.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "***********"
      + skip_delete         = (known after apply)
    }

  # module.order-notification-tms.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-tms.google_pubsub_subscription.push_subscriptions["order-notification-tms-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-tms-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-tms"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-tms-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-tms.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-tms-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-tms-push"
    }

  # module.order-notification-tms.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-tms"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-tms.google_pubsub_topic_iam_member.push_topic_binding["order-notification-tms-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-tms-dl"
    }

  # module.order-notification-tms-dl.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.order-notification-tms-dl.google_pubsub_subscription.pull_subscriptions["order-notification-tms-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-tms-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-tms-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-tms-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-tms-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-tms-dl-error"
    }

  # module.order-notification-tms-dl.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "order-notification-tms-dl"
      + project = "ebo-staging"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.order-notification-tms-dl.google_pubsub_topic_iam_member.pull_topic_binding["order-notification-tms-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/order-notification-tms-dl"
    }

Plan: 50 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #427](https://github.com/ebomart/commerce-infrastructure/actions/runs/1778269570)